// © Copyright 2004-2008, 2015 HP Development Company, L.P.

TaskName = "Uaktualnienie firmware";

// Errors
FileOpenError = "Nie można otworzyć pliku %@";
FileOpenErrorExplanation = "Plik jest uszkodzony, mógł zostać przeniesiony do innej lokalizacji, zmieniono jego nazwę lub usunięto go. Sprawdź lokalizację pliku lub wybierz inny plik i spróbuj ponownie.";
PrintChannelOpenError = "Nie można otworzyć kanału drukarki";
PrintChannelOpenErrorExplanation = "Upewnij się, że drukarka jest podłączona i włączona, a następnie spróbuj ponownie.";
SendDataError = "Nie można wysłać danych do drukarki";
SendDataErrorExplanation = "Upewnij się, że drukarka jest podłączona i włączona, a następnie spróbuj ponownie.";

SomePenErrorTitle = "Nie można uaktualnić oprogramowania firmware";
DoorOpenMsg = "Nie można uaktualnić oprogramowania firmware, ponieważ pokrywa jest otwarta. Zamknij wszystkie pokrywy drukarki.";

// Aquamarine Errors
FileCheckError = "Nie można uaktualnić oprogramowania firmware";
FileCheckErrorExplanation = "Pakiet firmware jest niepoprawny. Wybierz inny plik i spróbuj ponownie.";

OkButton = "Ok";
CancelButton = "Anuluj";
FirmwareUpdateTitle = "Uaktualnienie firmware";
FirmwareUpdateDeviceState = "Drukowanie";
FirmwareUpdateCancelingDeviceState = "Anulowanie";

// Great Wall Messages
PrinterIdleWarning = "Uaktualnienie firmware mogło się nie powieść, jeśli drukarka była zajęta (np. podczas drukowania zadania lub kalibracji).\n\nPrzed kontynuowaniem procesu uaktualnienia firmware sprawdź, czy drukarka jest wolna.";
UpdateSuccessful = "Przesyłanie pliku firmware zakończyło się powodzeniem i drukarka za chwilę zostanie zaktualizowana.\n\nPo zakończeniu uaktualnienia firmware drukarka zostanie automatycznie uruchomiona ponownie.";
InvalidPackage = "Wystąpiły problemy z plikiem firmware i proces uaktualnienia firmware nie powiódł się. Problem mógł zostać spowodowany przez błąd transmisji.\n\nSpróbuj ponownie wykonać proces uaktualnienia firmware.\nJeśli problem nie zniknie, skontaktuj się z Pomocą techniczną HP.";
FailedDependencies = "Nie można ukończyć procesu uaktualnienia firmware z powodu problemu z zależnościami.\n\nAktualna wersja firmware to %@, a instalowana — %@.\n\nOdwiedź następującą stronę, aby znaleźć odpowiedni pakiet uaktualnienia dla tej drukarki:\n%@.";
NotNow = "Uaktualnienie firmware nie powiodło się, ponieważ drukarka jest zajęta (np. trwa przetwarzanie lub drukowanie zadania).\n\nSprawdź, czy drukarka jest wolna i spróbuj ponownie wykonać uaktualnienie firmware.";
TransmissionError = "Wystąpiły problemy z transmisją, które spowodowały niepowodzenie wykonania uaktualnienia firmware.\n\nSprawdź połączenie drukarki i wykonaj ponownie uaktualnienie firmware.";
LicenseNotAccepted = "Nie wykonano uaktualnienia firmware ponieważ licencja nie została zaakceptowana.";
FatalError = "Wystąpiły problemy, które spowodowały, że proces uaktualnienia firmware nie został ukończony.\n\nJeśli problem nie zniknie, skontaktuj się z pomocą techniczną HP.";

// layout
TaskTitle = "Uaktualnienie firmware";
TaskDescription = "Wybierz plik zawierający uaktualnienie firmware i prześlij go do drukarki, aby ją zaktualizować.";
FileNameTitle = "Nazwa pliku:";
FileNameField = "<Nie wybrano>";
ChooseButton = "Wybierz...";
UpdateButton = "Uaktualnij";
ProgressPanel = "Postęp aktualizacji";
FirmwareUpdateProcessTitle = "Aktualizacja...";
